export const COMMON_SPECIES = [
  "长戟大兜虫",
  "海神大兜虫",
  "撒旦大兜虫",
  "亚克提恩大兜虫 (象兜)",
  "毛象大兜虫",
  "战神大兜虫",
  "南洋大兜虫",
  "美东白兜",
  "美西白兜",
  "独角仙 (双叉犀金龟)",
  "姬兜虫",
  "苏门答腊巨扁锹甲",
  "巴拉望巨扁锹甲",
  "中国大锹",
  "彩虹锹甲"
];

export const DEFAULT_SUBSPECIES_MAP = {
  "长戟大兜虫": ["DHH", "DHL", "DHP", "DHB", "RE", "C68", "UB"],
  "毛象大兜虫": ["原名亚种", "盖亚斯", "帕克"],
  "南洋大兜虫": ["CC", "CA", "CB"],
  "苏门答腊巨扁锹甲": ["亚齐", "明古鲁"],
  "中国大锹": ["建宁", "北峰", "湖南", "阿坝"],
  "巴拉望巨扁锹甲": ["MT", "神明"],
};

export const DEFAULT_BLOODLINE_MAP = {
  "长戟大兜虫": ["极太", "红眼", "A血", "纯血"],
  "苏门答腊巨扁锹甲": ["极太"],
  "中国大锹": ["极太", "A血", "纯血"],
};
